Autodesk.Revit.DB.ViewNavigationToolSettings.GetHomeCamera
Gets a copy of the structure containing information about the store Home view orientation.
Returns:
A copy of the structure containing information about the store Home view orientation, or
null if there is no home view set for this document.
Since:
2016

Autodesk.Revit.DB.ViewNavigationToolSettings.IsHomeCameraSet
Checks if the home view is set in the settings.
Returns:
Returns true if home view is set, otherwise false.
Since:
2016

Autodesk.Revit.DB.ViewNavigationToolSettings.GetViewNavigationToolSettings(Autodesk.Revit.DB.Document)
Gets the instance of the settings for the given document.
pADoc:
The document.
Returns:
The instance of the settings for the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.ViewNavigationToolSettings
Represents the settings contained in the document associated to the View Navigation tools (such as the View Cube).
Since:
2016